tap "tsung-ju/iguanatexmac"
brew "aom"
brew "bat"
brew "cairo"
brew "ccache"
brew "clang-format"
brew "cmake"
brew "eza"
brew "fd"
brew "fzf"
brew "gcc"
brew "gd"
brew "gdk-pixbuf"
brew "ghcup"
brew "ghostscript"
brew "git"
brew "glib"
brew "go"
brew "gobject-introspection"
brew "graphviz"
brew "gts"
brew "harfbuzz"
brew "hugo"
brew "isl"
brew "jpeg-xl"
brew "libproxy"
brew "librsvg"
brew "libtiff"
brew "little-cms2"
brew "llvm"
brew "mpfr"
brew "ncurses"
brew "netpbm"
brew "ninja"
brew "node"
brew "openjpeg"
brew "pango"
brew "python@3.10"
brew "python@3.12"
brew "python@3.9"
brew "qt"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "stow"
brew "uv"
brew "virtualenv"
brew "webp"
brew "zoxide"
brew "zsh"
cask "appcleaner"
cask "clipy"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "mactex-no-gui"
cask "notion"
cask "rectangle"
cask "slack"
cask "tsung-ju/iguanatexmac/iguanatexmac"
cask "visual-studio-code"
cask "xquartz"
cask "zoom"
vscode "alefragnani.bookmarks"
vscode "analytic-signal.preview-pdf"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "charliermarsh.ruff"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "gruntfuggly.todo-tree"
vscode "haskell.haskell"
vscode "ibm.output-colorizer"
vscode "james-yu.latex-workshop"
vscode "justusadam.language-haskell"
vscode "kuone.sequence-number"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "llvm-vs-code-extensions.vscode-mlir"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "mushan.vscode-paste-image"
vscode "mystery.vasp-support"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "rreverser.llvm"
vscode "rust-lang.rust-analyzer"
vscode "ryuta46.multi-command"
vscode "seatonjiang.gitmoji-vscode"
vscode "stevebushresearch.buildoutputcolorizer"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "wmaurer.change-case"
vscode "xaver.clang-format"
vscode "yzhang.markdown-all-in-one"
cargo "cargo-edit"
